{
  "work": [
    {
      "id": 1,
      "company": "Tech Innovations Inc.",
      "position": "Senior Frontend Developer",
      "location": "San Francisco, CA",
      "startDate": "2020-03",
      "endDate": "Present",
      "description": "Leading the frontend development team in building modern web applications using Vue.js and related technologies.",
      "responsibilities": [
        "Architected and implemented the company's flagship SaaS product using Vue.js and Vuex",
        "Mentored junior developers and conducted code reviews to ensure code quality",
        "Collaborated with UX/UI designers to implement responsive and accessible interfaces",
        "Optimized application performance, reducing load time by 40%",
        "Implemented automated testing with Jest and Cypress, achieving 85% code coverage"
      ],
      "technologies": ["Vue.js", "JavaScript", "HTML/CSS", "REST APIs", "Git"]
    },
    {
      "id": 2,
      "company": "WebSolutions Co.",
      "position": "Frontend Developer",
      "location": "Boston, MA",
      "startDate": "2018-06",
      "endDate": "2020-02",
      "description": "Developed and maintained client websites and web applications using modern frontend technologies.",
      "responsibilities": [
        "Built responsive websites for clients across various industries",
        "Converted design mockups into functional web interfaces",
        "Implemented e-commerce functionality using Shopify and custom solutions",
        "Collaborated with backend developers to integrate frontend with APIs",
        "Participated in agile development processes, including daily standups and sprint planning"
      ],
      "technologies": ["JavaScript", "React", "HTML/CSS", "SASS", "Webpack"]
    },
    {
      "id": 3,
      "company": "Digital Agency XYZ",
      "position": "Web Developer Intern",
      "location": "New York, NY",
      "startDate": "2017-09",
      "endDate": "2018-05",
      "description": "Assisted in the development of websites and digital marketing materials for agency clients.",
      "responsibilities": [
        "Developed and maintained client websites using HTML, CSS, and JavaScript",
        "Created email marketing templates that were responsive across different email clients",
        "Assisted senior developers with debugging and quality assurance",
        "Participated in client meetings and contributed to project planning",
        "Learned and implemented best practices for web accessibility and SEO"
      ],
      "technologies": ["HTML", "CSS", "JavaScript", "jQuery", "WordPress"]
    }
  ],
  "volunteer": [
    {
      "id": 4,
      "organization": "Code for Good",
      "position": "Volunteer Developer",
      "location": "Remote",
      "startDate": "2019-01",
      "endDate": "Present",
      "description": "Contributing to open-source projects that support non-profit organizations and social causes.",
      "responsibilities": [
        "Developed features for a volunteer management system used by multiple non-profits",
        "Fixed bugs and improved accessibility in existing applications",
        "Mentored coding bootcamp graduates on real-world projects",
        "Participated in weekend hackathons to build solutions for community problems"
      ],
      "technologies": ["JavaScript", "Vue.js", "Node.js", "MongoDB"]
    },
    {
      "id": 5,
      "organization": "Tech Mentors Network",
      "position": "Programming Instructor",
      "location": "Chicago, IL",
      "startDate": "2018-09",
      "endDate": "2019-12",
      "description": "Taught web development skills to underrepresented groups in the tech industry.",
      "responsibilities": [
        "Conducted weekly workshops on HTML, CSS, and JavaScript fundamentals",
        "Created curriculum and learning materials for beginner web developers",
        "Provided one-on-one mentoring to students working on personal projects",
        "Organized coding events and hackathons for the local community"
      ],
      "technologies": ["HTML", "CSS", "JavaScript", "Git"]
    }
  ]
}